cases/old/on-caso-1.2-fluidonly/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
6144
(
(0.0012509814 -0.0010266539 0.0005)
(0.0013662996 -0.0011212931 0.0005)
(0.0014816294 -0.0012159419 0.0005)
(0.0014272341 -0.0007628726 0.0005)
(0.0015587997 -0.00083319587 0.0005)
(0.0016903786 -0.00090352627 0.0005)
(0.0015486391 -0.00046977459 0.0005)
(0.0016913961 -0.00051307945 0.0005)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
192
(
(0.0012509814 -0.0010266539 0)
(0.0014272341 -0.0007628726 0)
(0.0015486391 -0.00046977459 0)
(0.0016105308 -0.00015862346 0)
(0.0016105308 0.00015862346 0)
(0.0015486391 0.00046977459 0)
(0.0014272341 0.0007628726 0)
(0.0012509814 0.0010266539 0)
...
)
;
    }
    fsi_pia
    {
        type            calculated;
        value           nonuniform List<vector> 
960
(
(0.0011923971 -0.00097857507 0.0005)
(0.0013603958 -0.00072714679 0.0005)
(0.0014761153 -0.00044777475 0.0005)
(0.0015351086 -0.00015119503 0.0005)
(0.0015351086 0.00015119503 0.0005)
(0.0014761153 0.00044777475 0.0005)
(0.0013603958 0.00072714679 0.0005)
(0.0011923971 0.00097857507 0.0005)
...
)
;
    }
    fsi_dura
    {
        type            calculated;
        value           nonuniform List<vector> 
960
(
(0.0018078273 -0.0014836455 0.0005)
(0.0020625353 -0.0011024481 0.0005)
(0.0022379812 -0.00067888417 0.0005)
(0.0023274227 -0.00022923113 0.0005)
(0.0023274227 0.00022923113 0.0005)
(0.0022379812 0.00067888417 0.0005)
(0.0020625353 0.0011024481 0.0005)
(0.0018078273 0.0014836455 0.0005)
...
)
;
    }
    lid_wall_inner
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(0.0011923971 -0.00097857507 0.030125)
(0.0013603958 -0.00072714679 0.030125)
(0.0014761153 -0.00044777475 0.030125)
(0.0015351086 -0.00015119503 0.030125)
(0.0015351086 0.00015119503 0.030125)
(0.0014761153 0.00044777475 0.030125)
(0.0013603958 0.00072714679 0.030125)
(0.0011923971 0.00097857507 0.030125)
...
)
;
    }
    lid_wall_outer
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(0.0018078273 -0.0014836455 0.030125)
(0.0020625353 -0.0011024481 0.030125)
(0.0022379812 -0.00067888417 0.030125)
(0.0023274227 -0.00022923113 0.030125)
(0.0023274227 0.00022923113 0.030125)
(0.0022379812 0.00067888417 0.030125)
(0.0020625353 0.0011024481 0.030125)
(0.0018078273 0.0014836455 0.030125)
...
)
;
    }
    outlet_peri
    {
        type            calculated;
        value           nonuniform List<vector> 
192
(
(0.0012509814 -0.0010266539 0.0305)
(0.0014272341 -0.0007628726 0.0305)
(0.0015486391 -0.00046977459 0.0305)
(0.0016105308 -0.00015862346 0.0305)
(0.0016105308 0.00015862346 0.0305)
(0.0015486391 0.00046977459 0.0305)
(0.0014272341 0.0007628726 0.0305)
(0.0012509814 0.0010266539 0.0305)
...
)
;
    }
}


// ************************************************************************* //
