cases/old/on-caso-1.2-fluidonly/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

// on-caso-1.2 ICP-driven mode: vazao volumetrica prescrita no inlet.
//
// Q_drainage_fisiologico ~ 3e-11 m^3/s (turnover ~0.5% do CSF cerebral
// que flui pela porcao perineural distal). Area do inlet anular:
//   A_inlet = pi*(R_dura_in^2 - R_pia_out^2) = pi*(2.35e-3^2 - 1.55e-3^2)
//           ~ 9.80e-6 m^2
// U_inlet_avg ~ 3.06e-6 m/s (positivo +z, do quiasma para o lid).

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 3e-6 );

boundaryField
{
    inlet
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  constant 3e-11;
        value               uniform ( 0 0 3e-6 );
    }

    outlet_peri
    {
        type            zeroGradient;
    }

    fsi_pia          { type noSlip; value uniform ( 0 0 0 ); }
    fsi_dura         { type noSlip; value uniform ( 0 0 0 ); }
    lid_wall_inner   { type fixedValue;         value uniform ( 0 0 0 ); }
    lid_wall_outer   { type fixedValue;         value uniform ( 0 0 0 ); }
}
