cases/old/on-caso-1.2-fluidonly/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

// on-caso-1.2 ICP-driven mode: pressao no inlet e' DETERMINADA pelo balanco
// (zeroGradient no inlet; vazao prescrita por flowRateInletVelocity em U).
// O outlet_peri permanece como referencia venosa (p=0 fixo).
//
// Quando d_Darcy aumenta (obstrucao linfatica), a vazao prescrita encontra
// mais resistencia no lid e a pressao no SAS bulk SOBE -> "ICP elevada"
// observavel diretamente, mecanismo SANS via compartimentalizacao.

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1.333;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet_peri
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    fsi_pia          { type zeroGradient; }
    fsi_dura         { type zeroGradient; }
    lid_wall_inner   { type zeroGradient; }
    lid_wall_outer   { type zeroGradient; }
}
