cases/old/on-caso-1.2-fluidonly/0/p.backup_qdriven
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

// on-caso-1 - pressao cinematica p/rho (pimpleFluid incompressivel).
// P_CSF = 1333 Pa  =>  p_kinematic = 1333 / 1000 = 1.333 m^2/s^2
//
// inlet (z=0):       cisterna quiasmatica = PIC normal
// outlet_peri (z=30.5): referencia venosa episcleral (p=0)
// 2 paredes FSI: zeroGradient (acoplamento via solidForce)
// 2 paredes do lid: zeroGradient (rigidas, sem fluxo)

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1.333;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.333;
    }

    outlet_peri
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    fsi_pia          { type zeroGradient; }
    fsi_dura         { type zeroGradient; }
    lid_wall_inner   { type zeroGradient; }
    lid_wall_outer   { type zeroGradient; }
}
