cases/old/on-caso-1.2-fluidonly/constant/fluidProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}

fluidModel pimpleFluid;

pimpleFluidCoeffs
{}
