cases/old/on-caso-1.2-fluidonly/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// LCR no SAS estatico: Re << 1, sem turbulencia.
simulationType   laminar;
