cases/old/on-caso-1.2-fluidonly/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "p|pFinal|pcorr|pcorrFinal"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.01;
        minIter         1;
        maxIter         500;
    }

    "cellMotionU|cellDisplacement|cellDisplacementFinal"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        minIter         1;
        maxIter         100;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "U|UFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
        minIter         1;
    }
}

PIMPLE
{
    nOuterCorrectors            5;
    nCorrectors                 3;
    nNonOrthogonalCorrectors    2;

    residualControl
    {
        p   { tolerance 1e-04; relTol 0; }
        U   { tolerance 1e-05; relTol 0; }
    }
}

relaxationFactors
{
    fields
    {
        p       0.3;
        pFinal  0.7;
    }
    equations
    {
        U       0.5;
        UFinal  0.9;
    }
}
